openenergymonitor/STM32/Software/Sombrero_VE_Working4b/Src/main.c
  double Vmean = (float)chn->sum_V / (float)chn->count;
  double Imean = (float)chn->sum_I / (float)chn->count;

  double f32sum_V_sq_avg = (float)chn->sum_V_sq / (float)chn->count;
  f32sum_V_sq_avg -= (Vmean * Vmean); // offset removal

  double f32sum_I_sq_avg = (float)chn->sum_I_sq / (float)chn->count;
  f32sum_I_sq_avg -= (Imean * Imean); // offset removal

  if (f32sum_V_sq_avg < 0) f32sum_V_sq_avg = 0; // if offset removal cause a negative number
  if (f32sum_I_sq_avg < 0) f32sum_I_sq_avg = 0; // make it 0 to avoid a nan at sqrt.

  Vrms = V_RATIO * sqrt(f32sum_V_sq_avg);
  Irms = I_RATIO * sqrt(f32sum_I_sq_avg);

  double f32_sum_P_avg = (float)chn->sum_P / (float)chn->count;
  double mean_P = f32_sum_P_avg - (Vmean * Imean); // offset removal
  
  realPower = V_RATIO * I_RATIO * mean_P;
  apparentPower = Vrms * Irms;

  // calculate PF, is it necessary to prevent dividing by zero error?
  if (apparentPower != 0) { powerFactor = realPower / apparentPower; }
  else powerFactor = 0;

  Ws_accumulator[ch] += (realPower * (posting_interval / 1000.0));
}


bool phase_corrector;
bool phase_corrector_channel[CTn];
int phase_corrections[CTn];
double last_powerFactor[CTn];
void process_frame (uint16_t offset)
{
  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_10, GPIO_PIN_SET); // blink the led

  uint16_t sample_V, sample_I;
  int16_t signed_V, signed_I;

  /*
  sprintf(log_buffer, "adc_buff_half_size:%d\r\n", adc_buff_half_size);
  debug_printf(log_buffer);
  log_buffer[0] = '\0';
  */

  for (uint16_t i = 0; i < adc_buff_half_size; i += CTn) // CTn = CT channel quanity.
  {
    
    /* // debug buffer
    sprintf(log_buffer, "signed_v:%d\r\n", signed_V);
    debug_printf(log_buffer);
    log_buffer[0] = '\0';
    */

    //----------------------------------------
    // Power
    //----------------------------------------
    // Cycle through channels, accumulating
    for (int ch = 0; ch < CTn; ch++)
    {
      channel_t *channel = &channels[ch];
      //----------------------------------------
      // Voltage
      sample_V = adc1_dma_buff[offset + i + ch]; // phase correction could happen here to have higher resolution.
      //if (sample_V == 4095) Vclipped = true; // unlikely
      signed_V = sample_V - MID_ADC_READING;
      channel->sum_V += signed_V;
      channel->sum_V_sq += signed_V * signed_V;
      //----------------------------------------
      // Current
      sample_I = adc3_dma_buff[offset + i + ch];
      if (sample_I == 4095) channel->Iclipped = true; // much more likely, useful safety information.
      signed_I = sample_I - MID_ADC_READING; // mid-rail removal possible through ADC4, option for future perhaps.
      channel->sum_I += signed_I;
      channel->sum_I_sq += signed_I * signed_I;
      //----------------------------------------
      // Power
      channel->sum_P += signed_V * signed_I;
      
      channel->count++;
      
      // upwards-zero-crossing detection, whole waveforms.
      channel->last_positive_V = channel->positive_V; // retrieve the previous value.
      if (signed_V >= 0) { channel->positive_V = true; } // changed > to >= . not important as MID_ADC_READING 2048 not accurate anyway.
      else { channel->positive_V = false; }
      //--------------------------------------------------
      //--------------------------------------------------
      if (!channel->last_positive_V && channel->positive_V) { // looking out for a upwards-zero crossing.
        channel->cycles++; // rather than count cycles for readings_ready, better to have the main loop ask for them.
        // debug cycle count 
        /*
        sprintf(log_buffer, "cycles%d:%ld\r\n", ch, channel->cycles);
        debug_printf(log_buffer);
        log_buffer[0] = '\0';
        */
        //----------------------------------------
        // bool phase_corrector;
        // bool phase_corrector_channel[CTn];
        // int phase_corrections[CTn];
        /*
        if (phase_corrector_channel[ch]) {
          
          calcPower(ch);
          if (powerFactor);
          phase_corrector_channel[ch];
        }
        */

        //----------------------------------------
        
        if (readings_requested && !channel_rdy_bools[ch]) { // if readings are needed by the main loop and channel is not ready.
          channel_t *channel_ready = &channels_ready[ch];
          // copy accumulators for use in main loop.
          memcpy((void*)channel_ready, (void*)channel, sizeof(channel_t));
          // reset accumulators to zero.
          memset((void*)channel, 0, sizeof(channel_t));
          // set channel_ready for the channel.
          channel_rdy_bools[ch] = true;
          // are all the channels ready?
          int chn_ready_count = 0;
          for (int j = 0; j < CTn; j++) {
            if (channel_rdy_bools[j]) chn_ready_count++;
          }
          if (chn_ready_count == CTn) { readings_ready = true; readings_requested = false; }    // if all the channels are ready
          // test waveform sync. printed result should go from 1 to 9.
          /*
          sprintf(log_buffer, "channelsRdy:%d\r\n", chn_ready_count);
          debug_printf(log_buffer);
          log_buffer[0] = '\0';
          */
        }
      }
      //--------------------------------------------------
      //--------------------------------------------------
    }
  }

  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_10, GPIO_PIN_RESET);
} // end process_frame().




/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
  V_RATIO = VCAL * VOLTS_PER_DIV;
  I_RATIO = ICAL * VOLTS_PER_DIV;
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

